src/test/resources/ladybug/04 Translate genereerDocumentIdentificatie_Di02.report.xml

<?xml version="1.0" encoding="UTF-8"?>
<java version="15" class="java.beans.XMLDecoder">
 <object class="nl.nn.testtool.Report" id="Report0">
  <void property="checkpoints">
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="message">
      <string>&lt;SOAP-ENV:Envelope xsi:schemaLocation=&quot;http://www.egem.nl/StUF/sector/zkn/0310 zkn0310-p28\zs-dms\zkn0310_msg_zs-dms_resolved.xsd&quot; xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:StUF=&quot;http://www.egem.nl/StUF/StUF0301&quot; xmlns:ZKN=&quot;http://www.egem.nl/StUF/sector/zkn/0310&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;\r
   &lt;SOAP-ENV:Header/&gt;\r
   &lt;SOAP-ENV:Body&gt;\r
      &lt;ZKN:genereerDocumentIdentificatie_Di02&gt;\r
         &lt;ZKN:stuurgegevens&gt;\r
            &lt;StUF:berichtcode&gt;Di02&lt;/StUF:berichtcode&gt;\r
            &lt;StUF:zender&gt;\r
               &lt;StUF:organisatie&gt;1900&lt;/StUF:organisatie&gt;\r
               &lt;StUF:applicatie&gt;GWS4all&lt;/StUF:applicatie&gt;\r
               &lt;StUF:gebruiker&gt;Gebruiker&lt;/StUF:gebruiker&gt;\r
            &lt;/StUF:zender&gt;\r
            &lt;StUF:ontvanger&gt;\r
               &lt;StUF:organisatie&gt;1900&lt;/StUF:organisatie&gt;\r
               &lt;StUF:applicatie&gt;CDR&lt;/StUF:applicatie&gt;\r
            &lt;/StUF:ontvanger&gt;\r
            &lt;StUF:referentienummer&gt;846dced4-2a22-4922-8f79-9cab6199b04c&lt;/StUF:referentienummer&gt;\r
            &lt;StUF:tijdstipBericht&gt;20201207224237566&lt;/StUF:tijdstipBericht&gt;\r
            &lt;StUF:functie&gt;genereerDocumentidentificatie&lt;/StUF:functie&gt;\r
         &lt;/ZKN:stuurgegevens&gt;\r
      &lt;/ZKN:genereerDocumentIdentificatie_Di02&gt;\r
   &lt;/SOAP-ENV:Body&gt;\r
&lt;/SOAP-ENV:Envelope&gt;</string>
     </void>
     <void property="name">
      <string>Translate genereerDocumentIdentificatie_Di02</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>1</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>translate</string>
     </void>
     <void property="name">
      <string>modus</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>4</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>generic</string>
     </void>
     <void property="name">
      <string>version</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>4</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>zds</string>
     </void>
     <void property="name">
      <string>protocol</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>4</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>VrijBericht</string>
     </void>
     <void property="name">
      <string>endpoint</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>4</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>&quot;http://www.egem.nl/StUF/sector/zkn/0310/genereerDocumentIdentificatie_Di02&quot;</string>
     </void>
     <void property="name">
      <string>soapAction</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>4</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>Ladybug_Test_Tool-2.2-20210330.112250-2aa64fa3:1788d493344:-7fb3</string>
     </void>
     <void property="name">
      <string>referentienummer</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>6</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>nl.haarlem.translations.zdstozgw.converter.impl.emulate.GenereerDocumentIdentificatieEmulator</string>
     </void>
     <void property="name">
      <string>converter</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>6</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>nl.haarlem.translations.zdstozgw.requesthandler.impl.LoggingRequestHandler</string>
     </void>
     <void property="name">
      <string>handler</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>6</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>translate/generic/zds/VrijBericht</string>
     </void>
     <void property="name">
      <string>path</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>6</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="encoding">
      <string>XMLEncoder</string>
     </void>
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;java version=&quot;15&quot; class=&quot;java.beans.XMLDecoder&quot;&gt;
 &lt;int&gt;200&lt;/int&gt;
&lt;/java&gt;
</string>
     </void>
     <void property="messageClassName">
      <string>java.lang.Integer</string>
     </void>
     <void property="name">
      <string>statusCode</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>5</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>documentidentificatie:8000408</string>
     </void>
     <void property="name">
      <string>kenmerk</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>5</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>Soapaction: &quot;http://www.egem.nl/StUF/sector/zkn/0310/genereerDocumentIdentificatie_Di02&quot; took 37 milliseconds</string>
     </void>
     <void property="name">
      <string>Total duration</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>6</int>
     </void>
    </object>
   </void>
   <void method="add">
    <object class="nl.nn.testtool.Checkpoint">
     <void property="level">
      <int>1</int>
     </void>
     <void property="message">
      <string>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&#13;
  &lt;SOAP-ENV:Header/&gt;&#13;
  &lt;SOAP-ENV:Body&gt;&#13;
    &lt;ns2:genereerDocumentIdentificatie_Du02 xmlns:ns1=&quot;http://www.egem.nl/StUF/StUF0301&quot; xmlns:ns2=&quot;http://www.egem.nl/StUF/sector/zkn/0310&quot;&gt;&#13;
      &lt;ns2:stuurgegevens&gt;&#13;
        &lt;ns1:berichtcode&gt;Du02&lt;/ns1:berichtcode&gt;&#13;
        &lt;ns1:zender&gt;&#13;
          &lt;ns1:organisatie&gt;1900&lt;/ns1:organisatie&gt;&#13;
          &lt;ns1:applicatie&gt;CDR&lt;/ns1:applicatie&gt;&#13;
        &lt;/ns1:zender&gt;&#13;
        &lt;ns1:ontvanger&gt;&#13;
          &lt;ns1:organisatie&gt;1900&lt;/ns1:organisatie&gt;&#13;
          &lt;ns1:applicatie&gt;GWS4all&lt;/ns1:applicatie&gt;&#13;
          &lt;ns1:gebruiker&gt;Gebruiker&lt;/ns1:gebruiker&gt;&#13;
        &lt;/ns1:ontvanger&gt;&#13;
        &lt;ns1:referentienummer&gt;Ladybug_Test_Tool-2.2-20210330.112250-2aa64fa3:1788d493344:-7fb3&lt;/ns1:referentienummer&gt;&#13;
        &lt;ns1:tijdstipBericht&gt;20210401135510&lt;/ns1:tijdstipBericht&gt;&#13;
        &lt;ns1:crossRefnummer&gt;846dced4-2a22-4922-8f79-9cab6199b04c&lt;/ns1:crossRefnummer&gt;&#13;
        &lt;ns1:functie&gt;genereerDocumentidentificatie&lt;/ns1:functie&gt;&#13;
      &lt;/ns2:stuurgegevens&gt;&#13;
      &lt;ns2:document ns1:entiteittype=&quot;EDC&quot; ns1:functie=&quot;entiteit&quot;&gt;&#13;
        &lt;ns2:identificatie&gt;8000408&lt;/ns2:identificatie&gt;&#13;
      &lt;/ns2:document&gt;&#13;
    &lt;/ns2:genereerDocumentIdentificatie_Du02&gt;&#13;
  &lt;/SOAP-ENV:Body&gt;&#13;
&lt;/SOAP-ENV:Envelope&gt;&#13;
</string>
     </void>
     <void property="name">
      <string>Translate genereerDocumentIdentificatie_Di02</string>
     </void>
     <void property="report">
      <object idref="Report0"/>
     </void>
     <void property="sourceClassName">
      <string>nl.haarlem.translations.zdstozgw.controller.SoapController</string>
     </void>
     <void property="threadName">
      <string>Thread-10</string>
     </void>
     <void property="type">
      <int>2</int>
     </void>
    </object>
   </void>
  </void>
  <void property="correlationId">
   <string>Ladybug_Test_Tool-2.2-20210330.112250-2aa64fa3:1788d493344:-7fb3</string>
  </void>
  <void property="description">
   <string></string>
  </void>
  <void property="endTime">
   <long>1617278110215</long>
  </void>
  <void property="estimatedMemoryUsage">
   <long>6528</long>
  </void>
  <void property="name">
   <string>04 Translate genereerDocumentIdentificatie_Di02</string>
  </void>
  <void property="path">
   <string>/</string>
  </void>
  <void property="startTime">
   <long>1617278110180</long>
  </void>
  <void property="storageId">
   <int>244</int>
  </void>
  <void property="stubStrategy">
   <string>Stub all external connection code</string>
  </void>
  <void property="transformation">
   <string></string>
  </void>
 </object>
</java>
